ext_common_addition/ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="015a5e71-6dc7-4bc2-a50c-fa1ea71ab233">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888045d6-ba8c-43b1-b536-7c557764fc60">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b94b39c7-d1eb-4128-89ea-6fe5410160da">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50c9ead0-2833-4f57-86bb-47fa6ffdc8aa">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73c9f7da-a335-4b2e-976f-57e95ab06e13">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5b27a28-42e1-42b3-806c-83e1fbeb7907">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a37e84ac-bf38-4699-99ca-e57572841cfc">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e4986aa8-bcf8-443e-9b49-4140b2505fa4">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_common_addition/ОбщиеДоработкиРВК/src/Enums/ВариантыПриемкиТоваров/ВариантыПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4ac76022-5cb3-45b4-bcb8-f601c15cee32">
  <name>ВариантыПриемкиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="763ad8c6-1bb4-4322-bb25-ee808af5a1c5">
    <name>НеРазделенаПоЗаказамИНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8d94a0e6-c8fc-4515-8e9a-c8a8e359a0a7">
    <name>РазделенаТолькоПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ext_common_addition/ОбщиеДоработкиРВК/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7af43f23-66b5-4041-bd23-3216b1d23915">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="49c74d36-ce0a-47f3-b6eb-899238c5cc0f">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c3c6b97e-7d9a-4a6b-8cfd-5a1d2a1e2450">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb8b5ad-0eec-40f5-88b2-f1412f212359">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a595dc27-9b9c-47fc-a70f-c6763ab3d7a2">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd906d50-e8be-4b18-b32c-c20813240936">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c545b75d-dd2d-4844-903e-a04b725622b7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="87bdbf54-2a81-44f1-b7b9-18f0ca2a2511">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_common_addition/ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура рвк_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВключитьИнтеркампани = Константы.рвк_ВключитьИнтеркампани.Получить();	
	ЕстьИнтеркампани = ВключитьИнтеркампани	И рвк_ОбщийМодульПовтИсп.ПартнерНашаОрганизация(Партнер);
	ДополнительныеСвойства.Вставить("ЕстьИнтеркампани", ЕстьИнтеркампани);
	
	Если ЕстьИнтеркампани Тогда
		Дата = НачалоДня(Дата);
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура рвк_ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	рвк_СформироватьПриобретение(Отказ);
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура рвк_ОбработкаПроведения(Отказ, РежимПроведения)
	
	рвк_СформироватьСчетФактуру(Отказ);
	рвк_ПровестиПриобраетение(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаПроведения

Процедура рвк_СформироватьСчетФактуру(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Не рвк_ОбщийМодульПовтИсп.СоздаватьСчетфактурАвтоматически(Организация) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыРегистрации = УчетНДСУПКлиентСервер.ПараметрыРегистрацииСчетовФактурВыданных();
	ЗаполнитьЗначенияСвойств(ПараметрыРегистрации,ЭтотОбъект);
	ПараметрыРегистрации.РеализацияТоваров = Истина;
	РезультатПроверки = УчетНДСУП.СчетаФактурыВыданныеНаОсновании(ПараметрыРегистрации);
	
	ЗначенияРеквизитовКонтрагентаРеализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИНН,КПП");
	ПерезаполнитьРеквизитыСчетаФактуры = Ложь;
	
	Если ЗначениеЗаполнено(РезультатПроверки.СчетаФактуры) Тогда
		
		ЗначенияРеквизитовСчетаФактуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РезультатПроверки.СчетаФактуры[0], "Номер,Дата,Склад,Контрагент,Партнер,ИННКонтрагента,КППКонтрагента");
		
		ПерезаполнитьРеквизитыСчетаФактуры = 
			ЗначенияРеквизитовСчетаФактуры.Контрагент <> Контрагент ИЛИ 
			ЗначенияРеквизитовСчетаФактуры.Партнер <> Партнер ИЛИ 
			ЗначенияРеквизитовСчетаФактуры.Склад <> Склад ИЛИ 
			ЗначенияРеквизитовКонтрагентаРеализации.ИНН <> ЗначенияРеквизитовСчетаФактуры.ИННКонтрагента ИЛИ 
			ЗначенияРеквизитовКонтрагентаРеализации.КПП <> ЗначенияРеквизитовСчетаФактуры.КППКонтрагента ИЛИ 
			СокрЛП(ЗначенияРеквизитовСчетаФактуры.Номер) <> СокрЛП(Номер) ИЛИ 
			НачалоДня(ЗначенияРеквизитовСчетаФактуры.Дата) <> НачалоДня(Дата);
		
		Если ПерезаполнитьРеквизитыСчетаФактуры Тогда
			СчетФактураОбъект = РезультатПроверки.СчетаФактуры[0].ПолучитьОбъект();
		КонецЕсли;
		
	Иначе
		СчетФактураОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
		СчетФактураОбъект.Заполнить(Ссылка);
		СчетФактураОбъект.Дата = Дата;
		
		СчетФактураОбъект.Организация = Организация;
		СчетФактураОбъект.ДатаВыставления = Дата;
		
		СчетФактураОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		СчетФактураОбъект.ДокументОснование = Ссылка;
		СтрокаДокументаОснования = СчетФактураОбъект.ДокументыОснования.Добавить();
		СтрокаДокументаОснования.ХозяйственнаяОперация = ХозяйственнаяОперация;
		СтрокаДокументаОснования.ДокументОснование = Ссылка;
		
		СчетФактураОбъект.ИдентификаторГосКонтракта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ИдентификаторГосКонтракта");
		
		ПерезаполнитьРеквизитыСчетаФактуры = Истина;
	КонецЕсли;
	
	Если ПерезаполнитьРеквизитыСчетаФактуры Тогда
		СчетФактураОбъект.Номер = Номер;
		СчетФактураОбъект.Дата = Дата;
		СчетФактураОбъект.Контрагент = Контрагент;
		СчетФактураОбъект.Партнер = Партнер;
		СчетФактураОбъект.Склад = Склад;
		СчетФактураОбъект.ИННКонтрагента = ЗначенияРеквизитовКонтрагентаРеализации.ИНН;
		СчетФактураОбъект.КППКонтрагента = ЗначенияРеквизитовКонтрагентаРеализации.КПП;
		Попытка
			СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось провести счет-фактуру по причине: " + ОписаниеОшибки();
			СообщениеПользователю.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура рвк_ПровестиПриобраетение(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Приобретение = Неопределено;
	Если ДополнительныеСвойства.Свойство("Приобретение", Приобретение) 
			И ЗначениеЗаполнено(Приобретение) Тогда
		ПриобретениеОбъект = Приобретение.ПолучитьОбъект();
		Попытка
			ПриобретениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстСообщения = 
				СтрШаблон("Документ не удалось провести: %1 проверьте заполненение соглашения с поставщиком: %2", Приобретение, ПриобретениеОбъект.Соглашение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура рвк_СформироватьПриобретение(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИнтеркампани = Ложь;
	Если Не ДополнительныеСвойства.Свойство("ЕстьИнтеркампани", ЕстьИнтеркампани) 
			Или Не ЕстьИнтеркампани Тогда
		Возврат;
	КонецЕсли;
	
	СоглашениеСПоставщиком = рвк_СоглашениеСПоставщиком();
	ПриобретениеGUID = Документы.РеализацияТоваровУслуг.рвк_ПриобретениеИнтеркампани(Ссылка);
	Если ЗначениеЗаполнено(ПриобретениеGUID) Тогда
		Приобретение = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПриобретениеGUID));
		Если ЗначениеЗаполнено(Приобретение) Тогда
			ПриобретениеОбъект = Приобретение.ПолучитьОбъект();
		КонецЕсли;
		Если ПриобретениеОбъект = Неопределено Тогда
			ПриобретениеОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		Иначе
			Если ПометкаУдаления <> ПриобретениеОбъект.ПометкаУдаления Тогда
				ПриобретениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			ИначеЕсли ПриобретениеОбъект.Проведен Тогда // Проведение будет в обработчике проведения
				ПриобретениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ПометкаУдаления Тогда
			Возврат;
		Иначе
			ПриобретениеОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		КонецЕсли;
	КонецЕсли;
	
	ПриобретениеОбъект.Заполнить(СоглашениеСПоставщиком);
	ПриобретениеОбъект.Дата = НачалоДня(Дата);
	ПриобретениеОбъект.ДатаВходящегоДокумента = Дата;
	ПриобретениеОбъект.НомерВходящегоДокумента = Номер;
	ПриобретениеОбъект.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;
	ПриобретениеОбъект.Товары.Загрузить(рвк_ТаблицаТоваровПриобретение(ПриобретениеОбъект.Склад));
	ПриобретениеОбъект.ЗаполнитьУсловияЗакупокПоСоглашению(Ложь);
	ПриобретениеОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ПриобретениеОбъект.Согласован = Истина;
	ПриобретениеОбъект.Записать();
	
	Приобретение = ПриобретениеОбъект.Ссылка;
	ДополнительныеСвойства.Вставить("Приобретение", Приобретение);
	рвк_ОбновитьСсылкуНаПриобретение(Приобретение);

	ТекстСообщения = СтрШаблон("Сформирован документ: %1", Приобретение);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
КонецПроцедуры

Функция рвк_ТаблицаТоваровПриобретение(Склад)
	
	ОписаниеТипаНеотрицательнаяСумма = Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип;
	
	ТаблицаТовары = ВидыЗапасов.Выгрузить();
	ТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТовары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТовары.Колонки.Добавить("Сумма", ОписаниеТипаНеотрицательнаяСумма);
	ТаблицаТовары.Колонки.Добавить("СуммаИтог", ОписаниеТипаНеотрицательнаяСумма);
	ТаблицаТовары.Колонки.Добавить("СуммаНДСВзаиморасчетов", ОписаниеТипаНеотрицательнаяСумма);
	ТаблицаТовары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	АналитикаУчетаНоменклатуры = ТаблицаТовары.ВыгрузитьКолонку("АналитикаУчетаНоменклатуры"); 
	РеквизитыАналитикиНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(АналитикаУчетаНоменклатуры, "Номенклатура,Характеристика");
	Для Каждого СтрокаТаблицыТовары Из ТаблицаТовары Цикл
		РеквизитыАналитики = РеквизитыАналитикиНоменклатуры[СтрокаТаблицыТовары.АналитикаУчетаНоменклатуры];
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыТовары, РеквизитыАналитики, "Номенклатура,Характеристика");
		СуммаСНДС = СтрокаТаблицыТовары.СуммаСНДС;
		СтрокаТаблицыТовары.Сумма = СуммаСНДС;
		СтрокаТаблицыТовары.СуммаИтог = СуммаСНДС;
		СтрокаТаблицыТовары.СуммаВзаиморасчетов = СуммаСНДС;
		СтрокаТаблицыТовары.СуммаНДСВзаиморасчетов = СуммаСНДС;
	КонецЦикла;
	
	ТаблицаТовары.ЗаполнитьЗначения(Склад, "Склад");
	
	Возврат ТаблицаТовары;	
	
КонецФункции

Процедура рвк_ОбновитьСсылкуНаПриобретение(Приобретение)
	ТаблицаСвойствИЗначений = УправлениеСвойствами.ЗначенияСвойств(Ссылка, Ложь);
	СвойстваПриобретениеИнтеркампани = Документы.РеализацияТоваровУслуг.рвк_СвойстваПриобретениеИнтеркампани();
	СтрокаЗначенияСвойства = ТаблицаСвойствИЗначений.Найти(СвойстваПриобретениеИнтеркампани, "Свойство");
	Если СтрокаЗначенияСвойства = Неопределено Тогда
		СтрокаЗначенияСвойства = ТаблицаСвойствИЗначений.Добавить();
		СтрокаЗначенияСвойства.Свойство = СвойстваПриобретениеИнтеркампани;
	КонецЕсли;
	СтрокаЗначенияСвойства.Значение = XMLСтрока(Приобретение); 
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Ссылка, ТаблицаСвойствИЗначений); 
КонецПроцедуры

Функция рвк_СоглашениеСПоставщиком()
	Перем Результат;
	
	ИмяСвойста = "СоглашениеСПоставщиком_fce5fe05c0de4363ac8f62295fa98d13";
	Гиперссылка = рвк_ОбщегоНазначения.ЗначениеСвойства(Партнер, ИмяСвойста, Неопределено);
	Попытка
		Результат = рвк_ОбщегоНазначения.СсылкуИзНавигационной(Гиперссылка);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	Если Не ЗначениеЗаполнено(Результат) Тогда
		ТекстСообщения = СтрШаблон("В дополнительных реквизитах Партнера: %1 не указано соглашение с поставщиком", Партнер);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
